Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # helm_release.casdoor[0] will be updated in-place
~ resource "helm_release" "casdoor" {
        id                         = "casdoor"
      ~ metadata                   = [
          - {
              - app_version    = "v1.570.0"
              - chart          = "casdoor-helm-charts"
              - first_deployed = 1765541208
              - last_deployed  = 1765559773
              - name           = "casdoor"
              - namespace      = "platform"
              - notes          = <<-EOT
                    1. Get the application URL by running these commands:
                      https://sso.zitian.party/
                EOT
              - revision       = 10
              - values         = jsonencode(
                    {
                      - config            = <<-EOT
                            appname = casdoor
                            httpport = 8000
                            origin = https://sso.zitian.party
                            staticBaseUrl = https://cdn.casbin.org
                            
                            # Database configuration
                            driverName = postgres
                            dataSourceName = user=postgres password=Ld63FK25alvAwewa18YS85JMPwxzkt host=postgresql.platform.svc.cluster.local port=5432 dbname=casdoor sslmode=disable
                            dbName = casdoor
                            
                            # Path to init_data.json (mounted via extraVolumes from ConfigMap)
                            initDataFile = /init-data/init_data.json
                        EOT
                      - extraVolumeMounts = [
                          - {
                              - mountPath = "/init-data"
                              - name      = "init-data"
                              - readOnly  = true
                            },
                        ]
                      - extraVolumes      = [
                          - {
                              - configMap = {
                                  - name = "casdoor-init-data"
                                }
                              - name      = "init-data"
                            },
                        ]
                      - image             = {
                          - name       = "casdoor"
                          - pullPolicy = "IfNotPresent"
                          - repository = "casbin"
                          - tag        = "v1.570.0"
                        }
                      - ingress           = {
                          - annotations = {
                              - "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
                            }
                          - className   = "traefik"
                          - enabled     = true
                          - hosts       = [
                              - {
                                  - host  = "sso.zitian.party"
                                  - paths = [
                                      - {
                                          - path     = "/"
                                          - pathType = "Prefix"
                                        },
                                    ]
                                },
                            ]
                          - tls         = [
                              - {
                                  - hosts      = [
                                      - "sso.zitian.party",
                                    ]
                                  - secretName = "casdoor-tls"
                                },
                            ]
                        }
                      - livenessProbe     = {
                          - failureThreshold = 3
                          - httpGet          = {
                              - path = "/"
                              - port = "http"
                            }
                          - periodSeconds    = 10
                        }
                      - readinessProbe    = {
                          - failureThreshold = 3
                          - httpGet          = {
                              - path = "/"
                              - port = "http"
                            }
                          - periodSeconds    = 10
                        }
                      - replicaCount      = 1
                      - resources         = {
                          - limits   = {
                              - cpu    = "500m"
                              - memory = "512Mi"
                            }
                          - requests = {
                              - cpu    = "100m"
                              - memory = "128Mi"
                            }
                        }
                      - service           = {
                          - port = 8000
                          - type = "ClusterIP"
                        }
                      - startupProbe      = {
                          - failureThreshold = 12
                          - httpGet          = {
                              - path = "/"
                              - port = "http"
                            }
                          - periodSeconds    = 10
                        }
                    }
                )
              - version        = "v1.570.0"
            },
        ] -> (known after apply)
        name                       = "casdoor"
      ~ values                     = [
          - (sensitive value),
          + (sensitive value),
        ]
      ~ version                    = "v1.570.0" -> "v1.702.0"
        # (25 unchanged attributes hidden)
    }

  # helm_release.oauth2_proxy[0] will be updated in-place
~ resource "helm_release" "oauth2_proxy" {
        id                         = "oauth2-proxy"
      ~ metadata                   = [
          - {
              - app_version    = "7.8.1"
              - chart          = "oauth2-proxy"
              - first_deployed = 1765479067
              - last_deployed  = 1765479067
              - name           = "oauth2-proxy"
              - namespace      = "platform"
              - notes          = <<-EOT
                    To verify that oauth2-proxy has started, run:
                    
                      kubectl --namespace=platform get pods -l "app=oauth2-proxy"
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - config    = {
                          - clientID     = "Ov23liHgsLcrcLZZigMh"
                          - clientSecret = "a6cfc2b4272c646d6d7d33418775a507996f4bfc"
                          - cookieSecret = "9ENwkvyQ1fbR4l5lYP5gcgQaqdqOSKoT"
                        }
                      - extraArgs = {
                          - cookie-domain             = ".zitian.party"
                          - cookie-samesite           = "lax"
                          - cookie-secure             = "true"
                          - email-domain              = "*"
                          - github-org                = ""
                          - pass-access-token         = "true"
                          - pass-authorization-header = "true"
                          - provider                  = "github"
                          - reverse-proxy             = "true"
                          - set-xauthrequest          = "true"
                          - skip-provider-button      = "true"
                        }
                      - ingress   = {
                          - annotations = {
                              - "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
                            }
                          - className   = "traefik"
                          - enabled     = true
                          - hosts       = [
                              - "auth.zitian.party",
                            ]
                          - path        = "/"
                          - pathType    = "Prefix"
                          - tls         = [
                              - {
                                  - hosts      = [
                                      - "auth.zitian.party",
                                    ]
                                  - secretName = "oauth2-proxy-tls"
                                },
                            ]
                        }
                      - resources = {
                          - limits   = {
                              - cpu    = "100m"
                              - memory = "128Mi"
                            }
                          - requests = {
                              - cpu    = "50m"
                              - memory = "64Mi"
                            }
                        }
                    }
                )
              - version        = "7.12.7"
            },
        ] -> (known after apply)
        name                       = "oauth2-proxy"
      ~ values                     = [
          - (sensitive value),
          + (sensitive value),
        ]
        # (26 unchanged attributes hidden)
    }

  # kubernetes_ingress_v1.dashboard will be updated in-place
~ resource "kubernetes_ingress_v1" "dashboard" {
        id     = "platform/kubernetes-dashboard"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "traefik.ingress.kubernetes.io/router.middlewares"    = "platform-oauth2-proxy-auth@kubernetescrd" -> null
                # (3 unchanged elements hidden)
            }
            name             = "kubernetes-dashboard"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.oauth2_auth_middleware[0] will be updated in-place
~ resource "kubernetes_manifest" "oauth2_auth_middleware" {
      ~ manifest = {
          ~ spec       = {
              ~ forwardAuth = {
                  ~ address             = "http://oauth2-proxy.platform.svc.cluster.local/oauth2/auth" -> "http://oauth2-proxy.platform.svc.cluster.local/"
                  ~ authResponseHeaders = [
                        # (1 unchanged element hidden)
                        "X-Auth-Request-Email",
                      - "X-Auth-Request-Access-Token",
                    ]
                  ~ trustForwardHeader  = true -> false
                }
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ forwardAuth       = {
                  ~ address                  = "http://oauth2-proxy.platform.svc.cluster.local/oauth2/auth" -> "http://oauth2-proxy.platform.svc.cluster.local/"
                  ~ authResponseHeaders      = [
                        # (1 unchanged element hidden)
                        "X-Auth-Request-Email",
                      - "X-Auth-Request-Access-Token",
                    ]
                  ~ trustForwardHeader       = true -> false
                    # (9 unchanged attributes hidden)
                }
                # (24 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # kubernetes_manifest.oauth2_auth_middleware_kubero[0] will be created
+ resource "kubernetes_manifest" "oauth2_auth_middleware_kubero" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + name      = "oauth2-proxy-auth"
              + namespace = "kubero"
            }
          + spec       = {
              + forwardAuth = {
                  + address             = "http://oauth2-proxy.platform.svc.cluster.local/"
                  + authResponseHeaders = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                    ]
                  + trustForwardHeader  = false
                }
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "oauth2-proxy-auth"
              + namespace                  = "kubero"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + addPrefix         = {
                  + prefix = (known after apply)
                }
              + basicAuth         = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + buffering         = {
                  + maxRequestBodyBytes  = (known after apply)
                  + maxResponseBodyBytes = (known after apply)
                  + memRequestBodyBytes  = (known after apply)
                  + memResponseBodyBytes = (known after apply)
                  + retryExpression      = (known after apply)
                }
              + chain             = {
                  + middlewares = (known after apply)
                }
              + circuitBreaker    = {
                  + checkPeriod      = (known after apply)
                  + expression       = (known after apply)
                  + fallbackDuration = (known after apply)
                  + recoveryDuration = (known after apply)
                  + responseCode     = (known after apply)
                }
              + compress          = {
                  + defaultEncoding      = (known after apply)
                  + encodings            = (known after apply)
                  + excludedContentTypes = (known after apply)
                  + includedContentTypes = (known after apply)
                  + minResponseBodyBytes = (known after apply)
                }
              + contentType       = {
                  + autoDetect = (known after apply)
                }
              + digestAuth        = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + errors            = {
                  + query          = (known after apply)
                  + service        = {
                      + healthCheck        = {
                          + followRedirects   = (known after apply)
                          + headers           = (known after apply)
                          + hostname          = (known after apply)
                          + interval          = (known after apply)
                          + method            = (known after apply)
                          + mode              = (known after apply)
                          + path              = (known after apply)
                          + port              = (known after apply)
                          + scheme            = (known after apply)
                          + status            = (known after apply)
                          + timeout           = (known after apply)
                          + unhealthyInterval = (known after apply)
                        }
                      + kind               = (known after apply)
                      + name               = (known after apply)
                      + namespace          = (known after apply)
                      + nativeLB           = (known after apply)
                      + nodePortLB         = (known after apply)
                      + passHostHeader     = (known after apply)
                      + port               = (known after apply)
                      + responseForwarding = {
                          + flushInterval = (known after apply)
                        }
                      + scheme             = (known after apply)
                      + serversTransport   = (known after apply)
                      + sticky             = {
                          + cookie = {
                              + domain   = (known after apply)
                              + httpOnly = (known after apply)
                              + maxAge   = (known after apply)
                              + name     = (known after apply)
                              + path     = (known after apply)
                              + sameSite = (known after apply)
                              + secure   = (known after apply)
                            }
                        }
                      + strategy           = (known after apply)
                      + weight             = (known after apply)
                    }
                  + status         = (known after apply)
                  + statusRewrites = (known after apply)
                }
              + forwardAuth       = {
                  + addAuthCookiesToResponse = (known after apply)
                  + address                  = "http://oauth2-proxy.platform.svc.cluster.local/"
                  + authRequestHeaders       = (known after apply)
                  + authResponseHeaders      = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                    ]
                  + authResponseHeadersRegex = (known after apply)
                  + forwardBody              = (known after apply)
                  + headerField              = (known after apply)
                  + maxBodySize              = (known after apply)
                  + preserveLocationHeader   = (known after apply)
                  + preserveRequestMethod    = (known after apply)
                  + tls                      = {
                      + caOptional         = (known after apply)
                      + caSecret           = (known after apply)
                      + certSecret         = (known after apply)
                      + insecureSkipVerify = (known after apply)
                    }
                  + trustForwardHeader       = false
                }
              + grpcWeb           = {
                  + allowOrigins = (known after apply)
                }
              + headers           = {
                  + accessControlAllowCredentials     = (known after apply)
                  + accessControlAllowHeaders         = (known after apply)
                  + accessControlAllowMethods         = (known after apply)
                  + accessControlAllowOriginList      = (known after apply)
                  + accessControlAllowOriginListRegex = (known after apply)
                  + accessControlExposeHeaders        = (known after apply)
                  + accessControlMaxAge               = (known after apply)
                  + addVaryHeader                     = (known after apply)
                  + allowedHosts                      = (known after apply)
                  + browserXssFilter                  = (known after apply)
                  + contentSecurityPolicy             = (known after apply)
                  + contentSecurityPolicyReportOnly   = (known after apply)
                  + contentTypeNosniff                = (known after apply)
                  + customBrowserXSSValue             = (known after apply)
                  + customFrameOptionsValue           = (known after apply)
                  + customRequestHeaders              = (known after apply)
                  + customResponseHeaders             = (known after apply)
                  + featurePolicy                     = (known after apply)
                  + forceSTSHeader                    = (known after apply)
                  + frameDeny                         = (known after apply)
                  + hostsProxyHeaders                 = (known after apply)
                  + isDevelopment                     = (known after apply)
                  + permissionsPolicy                 = (known after apply)
                  + publicKey                         = (known after apply)
                  + referrerPolicy                    = (known after apply)
                  + sslForceHost                      = (known after apply)
                  + sslHost                           = (known after apply)
                  + sslProxyHeaders                   = (known after apply)
                  + sslRedirect                       = (known after apply)
                  + sslTemporaryRedirect              = (known after apply)
                  + stsIncludeSubdomains              = (known after apply)
                  + stsPreload                        = (known after apply)
                  + stsSeconds                        = (known after apply)
                }
              + inFlightReq       = {
                  + amount          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + ipAllowList       = {
                  + ipStrategy       = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + rejectStatusCode = (known after apply)
                  + sourceRange      = (known after apply)
                }
              + ipWhiteList       = {
                  + ipStrategy  = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + sourceRange = (known after apply)
                }
              + passTLSClientCert = {
                  + info = {
                      + issuer       = {
                          + commonName      = (known after apply)
                          + country         = (known after apply)
                          + domainComponent = (known after apply)
                          + locality        = (known after apply)
                          + organization    = (known after apply)
                          + province        = (known after apply)
                          + serialNumber    = (known after apply)
                        }
                      + notAfter     = (known after apply)
                      + notBefore    = (known after apply)
                      + sans         = (known after apply)
                      + serialNumber = (known after apply)
                      + subject      = {
                          + commonName         = (known after apply)
                          + country            = (known after apply)
                          + domainComponent    = (known after apply)
                          + locality           = (known after apply)
                          + organization       = (known after apply)
                          + organizationalUnit = (known after apply)
                          + province           = (known after apply)
                          + serialNumber       = (known after apply)
                        }
                    }
                  + pem  = (known after apply)
                }
              + plugin            = (known after apply)
              + rateLimit         = {
                  + average         = (known after apply)
                  + burst           = (known after apply)
                  + period          = (known after apply)
                  + redis           = {
                      + db             = (known after apply)
                      + dialTimeout    = (known after apply)
                      + endpoints      = (known after apply)
                      + maxActiveConns = (known after apply)
                      + minIdleConns   = (known after apply)
                      + poolSize       = (known after apply)
                      + readTimeout    = (known after apply)
                      + secret         = (known after apply)
                      + tls            = {
                          + caSecret           = (known after apply)
                          + certSecret         = (known after apply)
                          + insecureSkipVerify = (known after apply)
                        }
                      + writeTimeout   = (known after apply)
                    }
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + redirectRegex     = {
                  + permanent   = (known after apply)
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + redirectScheme    = {
                  + permanent = (known after apply)
                  + port      = (known after apply)
                  + scheme    = (known after apply)
                }
              + replacePath       = {
                  + path = (known after apply)
                }
              + replacePathRegex  = {
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + retry             = {
                  + attempts        = (known after apply)
                  + initialInterval = (known after apply)
                }
              + stripPrefix       = {
                  + forceSlash = (known after apply)
                  + prefixes   = (known after apply)
                }
              + stripPrefixRegex  = {
                  + regex = (known after apply)
                }
            }
        }
    }

  # terraform_data.one_auth_precheck will be created
+ resource "terraform_data" "one_auth_precheck" {
      + id     = (known after apply)
      + input  = {
          + enabled = false
        }
      + output = (known after apply)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

Changes to Outputs:
~ oauth2_proxy_auth_url          = (sensitive value)
+ one_auth_enabled               = false
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 2 to add, 4 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`